Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Constructs a newly allocated Integer object that represents the specified int value.
zh_cn: 构造一个新分配的 Integer 对象，它表示指定的 int 值。

source: Constructs a newly allocated Long object that represents the long value indicated by the String parameter.
zh_cn: 构造新分配的 Long 对象，表示由 String 参数指示的 long 值。

source: Constructs a newly allocated Long object that represents the specified long argument.
zh_cn: 构造新分配的 Long 对象，表示指定的 long 参数。

source: Constructs a newly allocated Short object that represents the short value indicated by the String parameter.
zh_cn: 构造一个新分配的 Short 对象，用来表示 String 参数所指示的 short 值。

source: Constructs a newly allocated Short object that represents the specified short value.
zh_cn: 构造一个新分配的 Short 对象，用来表示指定的 short 值。

source: Constructs a process builder with the specified operating system program and arguments.
zh_cn: 利用指定的操作系统程序和参数构造一个进程生成器。

source: Constructs a string buffer initialized to the contents of the specified string.
zh_cn: 构造一个字符串缓冲区，并将其内容初始化为指定的字符串内容。

source: Constructs a string buffer that contains the same characters as the specified CharSequence.
zh_cn: 构造一个字符串缓冲区，它包含与指定的 CharSequence 相同的字符。

source: Constructs a string buffer with no characters in it and an initial capacity of 16 characters.
zh_cn: 构造一个其中不带字符的字符串缓冲区，其初始容量为 16 个字符。

source: Constructs a string buffer with no characters in it and the specified initial capacity.
zh_cn: 构造一个不带字符，但具有指定初始容量的字符串缓冲区。

source: Constructs a string builder initialized to the contents of the specified string.
zh_cn: 构造一个字符串生成器，并初始化为指定的字符串内容。

source: Constructs a string builder that contains the same characters as the specified CharSequence.
zh_cn: 构造一个字符串生成器，包含与指定的 CharSequence 相同的字符。

source: Constructs a string builder with no characters in it and an initial capacity of 16 characters.
zh_cn: 构造一个其中不带字符的字符串生成器，初始容量为 16 个字符。

source: Constructs a string builder with no characters in it and an initial capacity specified by the capacity argument.
zh_cn: 构造一个其中不带字符的字符串生成器，初始容量由 capacity 参数指定。

source: Constructs an InvocationTargetException with null as the target exception.
zh_cn: 构造以 null 作为目标异常的 InvocationTargetException。

source: Constructs an UndeclaredThrowableException with the specified Throwable and a detail message.
zh_cn: 根据指定的 Throwable 和详细消息构造 UndeclaredThrowableException。

source: Constructs an UndeclaredThrowableException with the specified Throwable.
zh_cn: 根据指定的 Throwable 构造一个 UndeclaredThrowableException。

source: Constructs an AnnotationTypeMismatchException for the specified annotation type element and found data type.
zh_cn: 构造针对指定的注释类型元素和找到的数据类型的 AnnotationTypeMismatchException。

source: Constructs an IncompleteAnnotationException to indicate that the named element was missing from the specified annotation type.
zh_cn: 构造一个指示指定注释类型中缺少指定元素的 IncompleteAnnotationException。

source: Constructs an empty HashMap with the default initial capacity (16) and the default load factor (0.75).
zh_cn: 构造一个具有默认初始容量 (16) 和默认加载因子 (0.75) 的空 HashMap。

source: Constructs an empty HashMap with the specified initial capacity and load factor.
zh_cn: 构造一个带指定初始容量和加载因子的空 HashMap。

source: Constructs an empty HashMap with the specified initial capacity and the default load factor (0.75).
zh_cn: 构造一个带指定初始容量和默认加载因子 (0.75) 的空 HashMap。

source: Contains the collections framework, legacy collection classes, event model, date and time facilities, internationalization, and miscellaneous utility classes (a string tokenizer, a random-number generator, and a bit array).
zh_cn: 包含 collection 框架、遗留的 collection 类、事件模型、日期和时间设施、国际化和各种实用工具类（字符串标记生成器、随机数生成器和位数组）。

source: Convenience class for reading character files.
zh_cn: 用来读取字符文件的便捷类。

source: Convenience class for writing character files.
zh_cn: 用来写入字符文件的便捷类。

source: Convenience method to set the accessible flag for an array of objects with a single security check (for efficiency).
zh_cn: 使用单一安全性检查（为了提高效率）为一组对象设置 accessible 标志的便捷方法。

source: Converts a ByteBuffer into an instance of class Class, with an optional ProtectionDomain.
zh_cn: 使用可选的 ProtectionDomain 将 ByteBuffer 转换为 Class 类的实例。

source: Converts all of the characters in this String to lower case using the rules of the default locale.
zh_cn: 使用默认语言环境的规则将此 String 中的所有字符都转换为小写。

source: Converts all of the characters in this String to lower case using the rules of the given Locale.
zh_cn: 使用给定 Locale 的规则将此 String 中的所有字符都转换为小写。

source: Converts all of the characters in this String to upper case using the rules of the default locale.
zh_cn: 使用默认语言环境的规则将此 String 中的所有字符都转换为大写。

source: Converts all of the characters in this String to upper case using the rules of the given Locale.
zh_cn: 使用给定 Locale 的规则将此 String 中的所有字符都转换为大写。

source: Converts an angle measured in degrees to an approximately equivalent angle measured in radians.
zh_cn: 将用角度表示的角转换为近似相等的用弧度表示的角。

source: Converts an angle measured in radians to an approximately equivalent angle measured in degrees.
zh_cn: 将用弧度表示的角转换为近似相等的用角度表示的角。

source: Converts an array of bytes into an instance of class Class, with an optional ProtectionDomain.
zh_cn: 使用可选的 ProtectionDomain 将一个 byte 数组转换为 Class 类的实例。

source: Converts an array of bytes into an instance of class Class.
zh_cn: 将一个 byte 数组转换为 Class 类的实例。

source: Converts the character (Unicode code point) argument to lowercase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符（Unicode 代码点）参数转换为小写。

source: Converts the character (Unicode code point) argument to titlecase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符（Unicode 代码点）参数转换为首字母大写。

source: Converts the character (Unicode code point) argument to uppercase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符（Unicode 代码点）参数转换为大写。

source: Converts the character argument to lowercase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符参数转换为小写。

source: Converts the character argument to titlecase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符参数转换为首字母大写。

source: Converts the character argument to uppercase using case mapping information from the UnicodeData file.
zh_cn: 使用取自 UnicodeData 文件的大小写映射信息将字符参数转换为大写。

source: Converts the object to a string.
zh_cn: 将对象转换为字符串。

source: Converts the specified character (Unicode code point) to its UTF-16 representation stored in a char array.
zh_cn: 将指定的字符（Unicode 代码点）转换成其存储在 char 数组中的 UTF-16 表示形式。

source: Converts the specified character (Unicode code point) to its UTF-16 representation.
zh_cn: 将指定字符（Unicode 代码点）转换为其 UTF-16 表示形式。

source: Converts the specified surrogate pair to its supplementary code point value.
zh_cn: 将指定的代理项对转换为其增补代码点值。

source: Converts this string to a new character array.
zh_cn: 将此字符串转换为一个新的字符数组。

source: CookieManager provides a concrete implementation of CookieHandler, which separates the storage of cookies from the policy surrounding accepting and rejecting cookies.
zh_cn: CookieManager 提供 CookieHandler 的具体实现，它将 cookie 的存储区与围绕接受和拒绝 cookie 的策略分离开来。

source: CookiePolicy implementations decide which cookies should be accepted and which should be rejected.
zh_cn: CookiePolicy 实现决定应该接受哪个 cookie 以及应该拒绝哪个 cookie。

source: Copies all of the mappings from the specified map to this map (optional operation).
zh_cn: 从指定映射中将所有映射关系复制到此映射中（可选操作）。

source: Copies all of the mappings from the specified map to this map.
zh_cn: 将指定映射的所有映射关系复制到此映射中。

source: Copies an array from the specified source array, beginning at the specified position, to the specified position of the destination array.
zh_cn: 从指定源数组中复制一个数组，复制从指定的位置开始，到目标数组的指定位置。

source: Copies characters from this string into the destination character array.
zh_cn: 将字符从此字符串复制到目标字符数组。

source: Copies into the specified array every active thread in the current thread's thread group and its subgroups.
zh_cn: 将当前线程的线程组及其子组中的每一个活动线程复制到指定的数组中。

source: Copies into the specified array every active thread in this thread group and its subgroups.
zh_cn: 将当前线程的线程组及其子组中的每一个活动线程复制到指定的数组中。

source: Copies into the specified array every active thread in this thread group.
zh_cn: 把此线程组中的所有活动线程复制到指定数组中。

source: Copies into the specified array references to every active subgroup in this thread group and its subgroups.
zh_cn: 复制到此线程组及其子组中每个活动子组的指定数组引用。

source: Copies into the specified array references to every active subgroup in this thread group.
zh_cn: 把对此线程组中的所有活动子组的引用复制到指定数组中。

source: Core and maximum pool sizes
zh_cn: 核心和最大池大小

source: Create a regular (non-tree) node
zh_cn: 创建一个常规(非树)节点

source: Create a tree bin node
zh_cn: 创建树 bin 节点

source: Creates a Spliterator over the elements described by this Iterable.
zh_cn: 在这个 Iterable 描述的元素上创建一个 Spliterator。

source: Creates a localized description of this throwable.
zh_cn: 创建此 throwable 的本地化描述。

source: Creates a new ThreadPoolExecutor with the given initial parameters and default rejected execution handler.
zh_cn: 用给定的初始参数和默认被拒绝的执行处理程序创建新的 ThreadPoolExecutor。

source: Creates a new ThreadPoolExecutor with the given initial parameters and default thread factory and rejected execution handler.
zh_cn: 用给定的初始参数和默认的线程工厂及被拒绝的执行处理程序创建新的 ThreadPoolExecutor。

source: Creates a new ThreadPoolExecutor with the given initial parameters and default thread factory.
zh_cn: 用给定的初始参数和默认的线程工厂创建新的 ThreadPoolExecutor。

source: Creates a new ThreadPoolExecutor with the given initial parameters.
zh_cn: 用给定的初始参数创建新的 ThreadPoolExecutor。

source: Creates a new array with the specified component type and dimensions.
zh_cn: 创建一个具有指定的组件类型和维度的新数组。

source: Creates a new array with the specified component type and length.
zh_cn: 创建一个具有指定的组件类型和长度的新数组。

source: Creates a new class loader using the ClassLoader returned by the method getSystemClassLoader() as the parent class loader.
zh_cn: 使用方法 getSystemClassLoader() 返回的 ClassLoader 创建一个新的类加载器，将该加载器作为父类加载器。

source: Creates a new class loader using the specified parent class loader for delegation.
zh_cn: 使用指定的、用于委托操作的父类加载器创建新的类加载器。

source: Creates a new instance of the class represented by this Class object.
zh_cn: 创建此 Class 对象所表示的类的一个新实例。

source: Creates a new phantom reference that refers to the given object and is registered with the given queue.
zh_cn: 创建一个引用给定对象的新的虚引用，并向给定队列注册它。

source: Creates a new soft reference that refers to the given object and is registered with the given queue.
zh_cn: 创建一个引用给定对象的新的软引用，并向给定队列注册该引用。

source: Creates a new soft reference that refers to the given object.
zh_cn: 创建引用给定对象的新的软引用。

source: Creates a new thread group.
zh_cn: 创建一个新线程组。

source: Creates a new weak reference that refers to the given object and is registered with the given queue.
zh_cn: 创建引用给定对象的新的弱引用，并向给定队列注册该引用。

source: Creates a new weak reference that refers to the given object.
zh_cn: 创建引用给定对象的新的弱引用。

source: Creates a stack trace element representing the specified execution point.
zh_cn: 创建表示指定执行点的堆栈跟踪元素。

source: Creates a thread local variable.
zh_cn: 创建一个线程本地变量。

source: Creates and returns a copy of this object.
zh_cn: 创建并返回此对象的一个副本。

source: Creating a type variable must not cause the creation of its bounds.
zh_cn: 创建某个类型变量决不能导致创建其边界。

source: Creating new threads
zh_cn: 创建新线程

source: DEFAULT_INITIAL_CAPACITY.)
zh_cn: 或者零表示 DEFAULT_INITIAL_CAPACITY。）

source: De-registers a previously-registered virtual-machine shutdown hook.
zh_cn: 取消注册某个先前已注册的虚拟机关闭钩子。

source: Decodes a String into a Byte.
zh_cn: 将 String 解码为 Integer。

source: Decodes a String into a Long.
zh_cn: 将 String 解码成 Long。

source: Decodes a String into a Short.
zh_cn: 将 String 解码为 Short。

source: Decodes a String into an Integer.
zh_cn: 将 String 解码为 Short。

source: Defines a package by name in this ClassLoader.
zh_cn: 根据 name 在此 ClassLoader 中定义包。

source: Defines attribute keys that are used to identify text attributes.
zh_cn: 定义用于标识文本属性的属性键。

source: Defines buffers, which are containers for data, and provides an overview of the other NIO packages.
zh_cn: 定义作为数据容器的缓冲区，并提供其他 NIO 包的概述。

source: Defines constants that are used as attribute keys in the AttributedCharacterIterator returned from DateFormat.formatToCharacterIterator and as field identifiers in FieldPosition.
zh_cn: 定义了各种常量，这些常量用作 DateFormat.formatToCharacterIterator 所返回的 AttributedCharacterIterator 中的属性键和 FieldPosition 中的字段标识符。

source: Defines constants that are used as attribute keys in the AttributedCharacterIterator returned from Format.formatToCharacterIterator and as field identifiers in FieldPosition.
zh_cn: 定义在 AttributedCharacterIterator （从 Format.formatToCharacterIterator 返回）中用作属性键和在 FieldPosition 中用作字段标识符的常量。

source: Defines constants that are used as attribute keys in the AttributedCharacterIterator returned from MessageFormat.formatToCharacterIterator.
zh_cn: 在从 MessageFormat.formatToCharacterIterator 返回的 AttributedCharacterIterator 中定义用作属性键的常量。

source: Defines constants that are used as attribute keys in the AttributedCharacterIterator returned from NumberFormat.formatToCharacterIterator and as field identifiers in FieldPosition.
zh_cn: 定义将用作从 NumberFormat.formatToCharacterIterator 返回的 AttributedCharacterIterator 中属性键以及 FieldPosition 中字段标识符的常量。

source: Defines the standard socket options.
zh_cn: 定义了 standard (标准) 插座选项。

source: Defines the standard families of communication protocols.
zh_cn: 定义的通信协议标准的家族。

source: Depending on which concrete Executor class is being used, tasks may execute in a newly created thread, an existing task-execution thread, or the thread calling execute, and may execute sequentially or concurrently.
zh_cn: 根据所使用的具体 Executor 类的不同，可能在新创建的线程中，现有的任务执行线程中，或者调用 execute 的线程中执行任务，并且可能顺序或并发执行。

source: Description
zh_cn: 描述

source: Destroys this thread group and all of its subgroups.
zh_cn: 销毁此线程组及其所有子组。

source: Determines if a character (Unicode code point) is defined in Unicode.
zh_cn: 确定字符（Unicode 代码点）是否被定义为 Unicode 中的字符。

source: Determines if a character is defined in Unicode.
zh_cn: 确定字符是否被定义为 Unicode 中的字符。

source: Determines if the character (Unicode code point) is permissible as the first character in a Java identifier.
zh_cn: 确定是否允许将字符（Unicode 代码点）作为 Java 标识符中的首字符。

source: Determines if the character (Unicode code point) may be part of a Java identifier as other than the first character.
zh_cn: 确定字符（Unicode 代码点）是否可以是 Java 标识符中首字符以外的部分。

source: Determines if the class or interface represented by this Class object is either the same as, or is a superclass or superinterface of, the class or interface represented by the specified Class parameter.
zh_cn: 判定此 Class 对象所表示的类或接口与指定的 Class 参数所表示的类或接口是否相同，或是否是其超类或超接口。

source: Determines if the currently running thread has permission to modify this thread group.
zh_cn: 确定当前运行的线程是否有权修改此线程组。

source: Determines if the currently running thread has permission to modify this thread.
zh_cn: 判定当前运行的线程是否有权修改该线程。

source: Determines if the given char value is a Unicode high-surrogate code unit (also known as leading-surrogate code unit).
zh_cn: 确定给出的 char 值是否为一个 Unicode 高代理项代码单元（也称为前导代理项代码单元）。

source: Determines if the given char value is a Unicode low-surrogate code unit (also known as trailing-surrogate code unit).
zh_cn: 确定给出的 char 值是否为一个 Unicode 低代理项代码单元（也称为尾部代理项代码单元）。

source: Determines if the given char value is a Unicode surrogate code unit.
zh_cn: 确定给定的 char 值是否为 Unicode surrogate code unit (代理代码单元)。

source: Determines if the referenced character (Unicode code point) is an ISO control character.
zh_cn: 确定引用的字符（Unicode 代码点）是否为 ISO 控制字符。

source: Determines if the specified Class object represents a primitive type.
zh_cn: 判定指定的 Class 对象是否表示一个基本类型。

source: Determines if the specified Class object represents an interface type.
zh_cn: 判定指定的 Class 对象是否表示一个接口类型。

source: Determines if the specified Object is assignment-compatible with the object represented by this Class.
zh_cn: 判定指定的 Object 是否与此 Class 所表示的对象赋值兼容。

source: Determines if the specified character (Unicode code point) is a CJKV (Chinese, Japanese, Korean and Vietnamese) ideograph, as defined by the Unicode Standard.
zh_cn: 确定指定字符(Unicode 代码点)是一个 CJKV(中国，日本，韩国和越南)象形文字，Unicode 标准定义。

source: Determines if the specified character (Unicode code point) is a Unicode space character.
zh_cn: 确定指定字符（Unicode 代码点）是否为 Unicode 空白字符。

source: Determines if the specified character (Unicode code point) is a digit.
zh_cn: 确定指定字符（Unicode 代码点）是否为数字。

source: Determines if the specified character (Unicode code point) is a letter or digit.
zh_cn: 确定指定字符（Unicode 代码点）是否为字母或数字。

source: Determines if the specified character (Unicode code point) is a letter.
zh_cn: 确定指定字符（Unicode 代码点）是否为字母。

source: Determines if the specified character (Unicode code point) is a lowercase character.
zh_cn: 确定指定字符（Unicode 代码点）是否为小写字母。

source: Determines if the specified character (Unicode code point) is a titlecase character.
zh_cn: 确定指定字符（Unicode 代码点）是否为首字母大写字符。

source: Determines if the specified character (Unicode code point) is an alphabet.
zh_cn: 确定指定字符（Unicode 代码点）是否为字母。

source: Determines if the specified character (Unicode code point) is an uppercase character.
zh_cn: 确定指定字符（Unicode 代码点）是否为大写字母。

source: Determines if the specified character (Unicode code point) is permissible as the first character in a Unicode identifier.
zh_cn: 确定是否允许将指定字符（Unicode 代码点）作为 Unicode 标识符中的首字符。

source: Determines if the specified character (Unicode code point) is white space according to Java.
zh_cn: 确定指定字符（Unicode 代码点）依据 Java 标准是否为空白字符。

source: Determines if the specified character (Unicode code point) may be part of a Unicode identifier as other than the first character.
zh_cn: 确定指定字符（Unicode 代码点）是否可以是 Unicode 标识符中首字符以外的部分。

source: Determines if the specified character (Unicode code point) should be regarded as an ignorable character in a Java identifier or a Unicode identifier.
zh_cn: 确定是否应该认为指定字符（Unicode 代码点）是 Java 标识符或 Unicode 标识符中可忽略的一个字符。

source: Determines if the specified character is a Unicode space character.
zh_cn: 确定指定字符是否为 Unicode 空白字符。

source: Determines if the specified character is a digit.
zh_cn: 确定指定字符是否为数字。

source: Determines if the specified character is a letter or digit.
zh_cn: 确定指定字符是否为字母或数字。

source: Determines if the specified character is a letter.
zh_cn: 确定指定字符是否为字母。

source: Determines if the specified character is a lowercase character.
zh_cn: 确定指定字符是否为小写字母。

source: Determines if the specified character is a titlecase character.
zh_cn: 确定指定字符是否为首字母大写字符。

source: Determines if the specified character is an ISO control character.
zh_cn: 确定指定字符是否为 ISO 控制字符。

source: Determines if the specified character is an uppercase character.
zh_cn: 确定指定字符是否为大写字母。

source: Determines if the specified character is permissible as the first character in a Java identifier.
zh_cn: 确定是否允许将指定字符作为 Java 标识符中的首字符。

source: Determines if the specified character is permissible as the first character in a Unicode identifier.
zh_cn: 确定是否允许将指定字符作为 Unicode 标识符中的首字符。

source: Determines if the specified character is white space according to Java.
zh_cn: 确定指定字符依据 Java 标准是否为空白字符。

source: Determines if the specified character may be part of a Java identifier as other than the first character.
zh_cn: 确定指定字符是否可以是 Java 标识符中首字符以外的部分。

source: Determines if the specified character may be part of a Unicode identifier as other than the first character.
zh_cn: 确定指定字符是否可以是 Unicode 标识符中首字符以外的部分。

source: Determines if the specified character should be regarded as an ignorable character in a Java identifier or a Unicode identifier.
zh_cn: 确定是否应该认为指定字符是 Java 标识符或 Unicode 标识符中可忽略的一个字符。

source: Determines if this Class object represents an array class.
zh_cn: 判定此 Class 对象是否表示一个数组类。

source: Determines the long value of the system property with the specified name.
zh_cn: 使用指定名称确定系统属性的 long 值。

source: Determines the character representation for a specific digit in the specified radix.
zh_cn: 确定使用指定基数的特定数字的字符表示形式。

source: Determines the current system properties.
zh_cn: 确定当前的系统属性。

source: Determines the integer value of the system property with the specified name.
zh_cn: 确定具有指定名称的系统属性的整数值。

source: Determines the interfaces implemented by the class or interface represented by this object.
zh_cn: 确定此对象所表示的类或接口实现的接口。

source: Determines the number of char values needed to represent the specified character (Unicode code point).
zh_cn: 确定表示指定字符（Unicode 代码点）所需的 char 值的数量。

source: Determines whether the character is mirrored according to the Unicode specification.
zh_cn: 确定指定字符依据 Unicode 规范是否对称。

source: Determines whether the specified character (Unicode code point) is in the Basic Multilingual Plane (BMP).
zh_cn: 确定指定字符（Unicode 代码点）是否在Basic Multilingual Plane (BMP)。

source: Determines whether the specified character (Unicode code point) is in the supplementary character range.
zh_cn: 确定指定字符（Unicode 代码点）是否在 增补字符 范围内。

source: Determines whether the specified character (Unicode code point) is mirrored according to the Unicode specification.
zh_cn: 确定指定字符（Unicode 代码点）依据 Unicode 规范是否对称。

source: Determines whether the specified code point is a valid Unicode code point value.
zh_cn: 确定指定的代码点是否为有效的 Unicode code point value。

source: Determines whether the specified pair of char values is a valid Unicode surrogate pair.
zh_cn: 确定指定的 char 值对是否为有效的 Unicode 代理项对。

source: Direct handoffs generally require unbounded maximumPoolSizes to avoid rejection of new submitted tasks.
zh_cn: 直接提交通常要求无界 maximumPoolSizes 以避免拒绝新提交的任务。

source: Does nothing on Android.
zh_cn: 在 Android 上什么都不做。

source: Doing so requires some care especially when policies are designed to work only under particular capacity or queuing policies.
zh_cn: 但这样做需要非常小心，尤其是当策略仅用于特定容量或排队策略时。

source: Doubly-linked list implementation of the List and Deque interfaces.
zh_cn: List 和 Deque 接口的双链表实现。

source: Each ProcessBuilder instance manages a collection of process attributes.
zh_cn: 每个 ProcessBuilder 实例管理一个进程属性集。

source: Each ThreadPoolExecutor also maintains some basic statistics, such as the number of completed tasks.
zh_cn: 每个 ThreadPoolExecutor 还维护着一些基本的统计数据，如完成的任务数。

source: Each action in a thread happens-before every action in that thread that comes later in the program's order.
zh_cn: 线程中的每个操作 happen-before 稍后按程序顺序传入的该线程中的每个操作。

source: Each class also provides appropriate utility methods for that type.
zh_cn: 每个类也为该类型提供适当的实用工具方法。

source: Each class defines a family of get and put methods for moving data out of and in to a buffer, methods for compacting, duplicating, and slicing a buffer, and static methods for allocating a new buffer as well as for wrapping an existing array into a buffer.
zh_cn: 每个类定义了一系列用于将数据移出或移入缓冲区的 get 和 put 方法，用于 压缩 、 复制 和 切片 缓冲区的方法，以及用于 分配 新缓冲区和将现有数组 包装 到缓冲区中的静态方法。

source: Each effectively converts a given datum to a string and then appends or inserts the characters of that string to the string buffer.
zh_cn: 每个方法都能有效地将给定的数据转换成字符串，然后将该字符串的字符追加或插入到字符串缓冲区中。

source: Each effectively converts a given datum to a string and then appends or inserts the characters of that string to the string builder.
zh_cn: 每个方法都能有效地将给定的数据转换成字符串，然后将该字符串的字符添加或插入到字符串生成器中。

source: Each element represents a single stack frame.
zh_cn: 每个元素表示单独的一个堆栈帧。

source: Each instance of ClassLoader has an associated parent class loader.
zh_cn: 每个 ClassLoader 实例都有一个相关的父类加载器。

source: Each object may be implemented by a different class, and there is no guarantee that each class will be capable of testing its instances for equality with those of the other.
zh_cn: 每个对象都可以通过一个不同的类实现，而且不能保证每个类能够测试其实例与其他类的实例的相等性。

source: Each of these subpackages has its own service-provider (SPI) subpackage, the contents of which can be used to extend the platform's default implementations or to construct alternative implementations.
zh_cn: 每个子包都具有自己的服务提供者接口 (SPI) 子包，SPI 子包的内容可用于扩展平台的默认实现或构造替代实现。

source: Each process builder manages these process attributes:
zh_cn: 每个进程生成器管理这些进程属性：
